
#01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

Import Modules

In [15]:

import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [16]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  9  4  3  5
1  6  8  7  8  1
2  1  7  6  4  6
3  7  9  7  6  7
4  8  5  8  2  8

In [17]:

tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')


Menyertakan Prefix Kolom

In [18]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        2        9        4        3        5
1        6        8        7        8        1
2        1        7        6        4        6
3        7        9        7        6        7
4        8        5        8        2        8

Menyertakan Suffix Kolom

In [19]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        2        9        4        3        5
1        6        8        7        8        1
2        1        7        6        4        6
3        7        9        7        6        7
4        8        5        8        2        8

#02: Pemilihan baris (rows selection) pada Data Frame

Persiapan Data Frame

In [20]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  4  3  4  4
1  3  3  3  2  2
2  2  2  1  3  3
3  4  1  4  1  2
4  2  4  4  2  2
5  2  4  1  1  3
6  3  2  4  4  1
7  2  1  3  3  1
8  3  4  1  4  1
9  3  1  2  1  4

Selection dengan operator logika |

In [21]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  3  3  3  2  2
6  3  2  4  4  1
8  3  4  1  4  1
9  3  1  2  1  4

Selection dengan fungsi isin()

In [22]:

df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  3  3  3  2  2
6  3  2  4  4  1
8  3  4  1  4  1
9  3  1  2  1  4


Mengenal operator negasi ~

In [23]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  2  4  3  4  4
2  2  2  1  3  3
3  4  1  4  1  2
4  2  4  4  2  2
5  2  4  1  1  3
7  2  1  3  3  1

#03: Konversi tipe data String ke Numerik pada kolom Data Frame

Persiapan Data Frame

In [24]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [25]:
df.dtypes

col1    object
col2    object
dtype: object

Konversi tipe data dengan fungsi astype()

In [26]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [27]:
df_x.dtypes

col1    object
col2     int64
dtype: object


Konversi tipe data numerik dengan fungsi to_numeric()

In [28]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

Persiapan Data Frame

In [29]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         16.0          7    A
1 2024-10-01 01:00:00         13.0          4    B
2 2024-10-01 02:00:00         18.0          8    C
3 2024-10-01 03:00:00          9.0          6    D
4 2024-10-01 04:00:00          9.0          5    E

In [30]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Memilih kolom bertipe data numerik

In [ ]:
df.select_dtypes(include='number')

In [ ]:
df.select_dtypes(include='float')

In [ ]:

df.select_dtypes(include='int')


Memilih kolom bertipe data string atau object

In [ ]:
df.select_dtypes(include='object')

Memilih kolom bertipe data datetime

In [ ]:

df.select_dtypes(include='datetime')

Memilih kolom dengan kombinasi tipe data

In [ ]:
df.select_dtypes(include=['number', 'object'])